; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l7-t1-p10---int100n150-m25---int100c110---s243---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level3 level3)
(sum level0 level4 level4)
(sum level0 level8 level8)
(sum level0 level10 level10)
(sum level0 level16 level16)
(sum level0 level17 level17)
(sum level0 level18 level18)
(sum level0 level20 level20)
(sum level1 level1 level2)
(sum level1 level3 level4)
(sum level1 level4 level5)
(sum level1 level8 level9)
(sum level1 level10 level11)
(sum level1 level16 level17)
(sum level1 level17 level18)
(sum level1 level18 level19)
(sum level1 level20 level21)
(sum level2 level1 level3)
(sum level2 level3 level5)
(sum level2 level4 level6)
(sum level2 level8 level10)
(sum level2 level10 level12)
(sum level2 level16 level18)
(sum level2 level17 level19)
(sum level2 level18 level20)
(sum level2 level20 level22)
(sum level3 level1 level4)
(sum level3 level3 level6)
(sum level3 level4 level7)
(sum level3 level8 level11)
(sum level3 level10 level13)
(sum level3 level16 level19)
(sum level3 level17 level20)
(sum level3 level18 level21)
(sum level3 level20 level23)
(sum level4 level1 level5)
(sum level4 level3 level7)
(sum level4 level4 level8)
(sum level4 level8 level12)
(sum level4 level10 level14)
(sum level4 level16 level20)
(sum level4 level17 level21)
(sum level4 level18 level22)
(sum level4 level20 level24)
(sum level5 level1 level6)
(sum level5 level3 level8)
(sum level5 level4 level9)
(sum level5 level8 level13)
(sum level5 level10 level15)
(sum level5 level16 level21)
(sum level5 level17 level22)
(sum level5 level18 level23)
(sum level5 level20 level25)
(sum level6 level1 level7)
(sum level6 level3 level9)
(sum level6 level4 level10)
(sum level6 level8 level14)
(sum level6 level10 level16)
(sum level6 level16 level22)
(sum level6 level17 level23)
(sum level6 level18 level24)
(sum level6 level20 level26)
(sum level7 level1 level8)
(sum level7 level3 level10)
(sum level7 level4 level11)
(sum level7 level8 level15)
(sum level7 level10 level17)
(sum level7 level16 level23)
(sum level7 level17 level24)
(sum level7 level18 level25)
(sum level7 level20 level27)
(sum level8 level1 level9)
(sum level8 level3 level11)
(sum level8 level4 level12)
(sum level8 level8 level16)
(sum level8 level10 level18)
(sum level8 level16 level24)
(sum level8 level17 level25)
(sum level8 level18 level26)
(sum level8 level20 level28)
(sum level9 level1 level10)
(sum level9 level3 level12)
(sum level9 level4 level13)
(sum level9 level8 level17)
(sum level9 level10 level19)
(sum level9 level16 level25)
(sum level9 level17 level26)
(sum level9 level18 level27)
(sum level9 level20 level29)
(sum level10 level1 level11)
(sum level10 level3 level13)
(sum level10 level4 level14)
(sum level10 level8 level18)
(sum level10 level10 level20)
(sum level10 level16 level26)
(sum level10 level17 level27)
(sum level10 level18 level28)
(sum level10 level20 level30)
(sum level11 level1 level12)
(sum level11 level3 level14)
(sum level11 level4 level15)
(sum level11 level8 level19)
(sum level11 level10 level21)
(sum level11 level16 level27)
(sum level11 level17 level28)
(sum level11 level18 level29)
(sum level11 level20 level31)
(sum level12 level1 level13)
(sum level12 level3 level15)
(sum level12 level4 level16)
(sum level12 level8 level20)
(sum level12 level10 level22)
(sum level12 level16 level28)
(sum level12 level17 level29)
(sum level12 level18 level30)
(sum level12 level20 level32)
(sum level13 level1 level14)
(sum level13 level3 level16)
(sum level13 level4 level17)
(sum level13 level8 level21)
(sum level13 level10 level23)
(sum level13 level16 level29)
(sum level13 level17 level30)
(sum level13 level18 level31)
(sum level13 level20 level33)
(sum level14 level1 level15)
(sum level14 level3 level17)
(sum level14 level4 level18)
(sum level14 level8 level22)
(sum level14 level10 level24)
(sum level14 level16 level30)
(sum level14 level17 level31)
(sum level14 level18 level32)
(sum level14 level20 level34)
(sum level15 level1 level16)
(sum level15 level3 level18)
(sum level15 level4 level19)
(sum level15 level8 level23)
(sum level15 level10 level25)
(sum level15 level16 level31)
(sum level15 level17 level32)
(sum level15 level18 level33)
(sum level15 level20 level35)
(sum level16 level1 level17)
(sum level16 level3 level19)
(sum level16 level4 level20)
(sum level16 level8 level24)
(sum level16 level10 level26)
(sum level16 level16 level32)
(sum level16 level17 level33)
(sum level16 level18 level34)
(sum level16 level20 level36)
(sum level17 level1 level18)
(sum level17 level3 level20)
(sum level17 level4 level21)
(sum level17 level8 level25)
(sum level17 level10 level27)
(sum level17 level16 level33)
(sum level17 level17 level34)
(sum level17 level18 level35)
(sum level17 level20 level37)
(sum level18 level1 level19)
(sum level18 level3 level21)
(sum level18 level4 level22)
(sum level18 level8 level26)
(sum level18 level10 level28)
(sum level18 level16 level34)
(sum level18 level17 level35)
(sum level18 level18 level36)
(sum level18 level20 level38)
(sum level19 level1 level20)
(sum level19 level3 level22)
(sum level19 level4 level23)
(sum level19 level8 level27)
(sum level19 level10 level29)
(sum level19 level16 level35)
(sum level19 level17 level36)
(sum level19 level18 level37)
(sum level19 level20 level39)
(sum level20 level1 level21)
(sum level20 level3 level23)
(sum level20 level4 level24)
(sum level20 level8 level28)
(sum level20 level10 level30)
(sum level20 level16 level36)
(sum level20 level17 level37)
(sum level20 level18 level38)
(sum level20 level20 level40)
(sum level21 level1 level22)
(sum level21 level3 level24)
(sum level21 level4 level25)
(sum level21 level8 level29)
(sum level21 level10 level31)
(sum level21 level16 level37)
(sum level21 level17 level38)
(sum level21 level18 level39)
(sum level21 level20 level41)
(sum level22 level1 level23)
(sum level22 level3 level25)
(sum level22 level4 level26)
(sum level22 level8 level30)
(sum level22 level10 level32)
(sum level22 level16 level38)
(sum level22 level17 level39)
(sum level22 level18 level40)
(sum level22 level20 level42)
(sum level23 level1 level24)
(sum level23 level3 level26)
(sum level23 level4 level27)
(sum level23 level8 level31)
(sum level23 level10 level33)
(sum level23 level16 level39)
(sum level23 level17 level40)
(sum level23 level18 level41)
(sum level23 level20 level43)
(sum level24 level1 level25)
(sum level24 level3 level27)
(sum level24 level4 level28)
(sum level24 level8 level32)
(sum level24 level10 level34)
(sum level24 level16 level40)
(sum level24 level17 level41)
(sum level24 level18 level42)
(sum level24 level20 level44)
(sum level25 level1 level26)
(sum level25 level3 level28)
(sum level25 level4 level29)
(sum level25 level8 level33)
(sum level25 level10 level35)
(sum level25 level16 level41)
(sum level25 level17 level42)
(sum level25 level18 level43)
(sum level25 level20 level45)
(sum level26 level1 level27)
(sum level26 level3 level29)
(sum level26 level4 level30)
(sum level26 level8 level34)
(sum level26 level10 level36)
(sum level26 level16 level42)
(sum level26 level17 level43)
(sum level26 level18 level44)
(sum level26 level20 level46)
(sum level27 level1 level28)
(sum level27 level3 level30)
(sum level27 level4 level31)
(sum level27 level8 level35)
(sum level27 level10 level37)
(sum level27 level16 level43)
(sum level27 level17 level44)
(sum level27 level18 level45)
(sum level27 level20 level47)
(sum level28 level1 level29)
(sum level28 level3 level31)
(sum level28 level4 level32)
(sum level28 level8 level36)
(sum level28 level10 level38)
(sum level28 level16 level44)
(sum level28 level17 level45)
(sum level28 level18 level46)
(sum level28 level20 level48)
(sum level29 level1 level30)
(sum level29 level3 level32)
(sum level29 level4 level33)
(sum level29 level8 level37)
(sum level29 level10 level39)
(sum level29 level16 level45)
(sum level29 level17 level46)
(sum level29 level18 level47)
(sum level29 level20 level49)
(sum level30 level1 level31)
(sum level30 level3 level33)
(sum level30 level4 level34)
(sum level30 level8 level38)
(sum level30 level10 level40)
(sum level30 level16 level46)
(sum level30 level17 level47)
(sum level30 level18 level48)
(sum level30 level20 level50)
(sum level31 level1 level32)
(sum level31 level3 level34)
(sum level31 level4 level35)
(sum level31 level8 level39)
(sum level31 level10 level41)
(sum level31 level16 level47)
(sum level31 level17 level48)
(sum level31 level18 level49)
(sum level31 level20 level51)
(sum level32 level1 level33)
(sum level32 level3 level35)
(sum level32 level4 level36)
(sum level32 level8 level40)
(sum level32 level10 level42)
(sum level32 level16 level48)
(sum level32 level17 level49)
(sum level32 level18 level50)
(sum level32 level20 level52)
(sum level33 level1 level34)
(sum level33 level3 level36)
(sum level33 level4 level37)
(sum level33 level8 level41)
(sum level33 level10 level43)
(sum level33 level16 level49)
(sum level33 level17 level50)
(sum level33 level18 level51)
(sum level33 level20 level53)
(sum level34 level1 level35)
(sum level34 level3 level37)
(sum level34 level4 level38)
(sum level34 level8 level42)
(sum level34 level10 level44)
(sum level34 level16 level50)
(sum level34 level17 level51)
(sum level34 level18 level52)
(sum level34 level20 level54)
(sum level35 level1 level36)
(sum level35 level3 level38)
(sum level35 level4 level39)
(sum level35 level8 level43)
(sum level35 level10 level45)
(sum level35 level16 level51)
(sum level35 level17 level52)
(sum level35 level18 level53)
(sum level35 level20 level55)
(sum level36 level1 level37)
(sum level36 level3 level39)
(sum level36 level4 level40)
(sum level36 level8 level44)
(sum level36 level10 level46)
(sum level36 level16 level52)
(sum level36 level17 level53)
(sum level36 level18 level54)
(sum level36 level20 level56)
(sum level37 level1 level38)
(sum level37 level3 level40)
(sum level37 level4 level41)
(sum level37 level8 level45)
(sum level37 level10 level47)
(sum level37 level16 level53)
(sum level37 level17 level54)
(sum level37 level18 level55)
(sum level37 level20 level57)
(sum level38 level1 level39)
(sum level38 level3 level41)
(sum level38 level4 level42)
(sum level38 level8 level46)
(sum level38 level10 level48)
(sum level38 level16 level54)
(sum level38 level17 level55)
(sum level38 level18 level56)
(sum level38 level20 level58)
(sum level39 level1 level40)
(sum level39 level3 level42)
(sum level39 level4 level43)
(sum level39 level8 level47)
(sum level39 level10 level49)
(sum level39 level16 level55)
(sum level39 level17 level56)
(sum level39 level18 level57)
(sum level39 level20 level59)
(sum level40 level1 level41)
(sum level40 level3 level43)
(sum level40 level4 level44)
(sum level40 level8 level48)
(sum level40 level10 level50)
(sum level40 level16 level56)
(sum level40 level17 level57)
(sum level40 level18 level58)
(sum level40 level20 level60)
(sum level41 level1 level42)
(sum level41 level3 level44)
(sum level41 level4 level45)
(sum level41 level8 level49)
(sum level41 level10 level51)
(sum level41 level16 level57)
(sum level41 level17 level58)
(sum level41 level18 level59)
(sum level41 level20 level61)
(sum level42 level1 level43)
(sum level42 level3 level45)
(sum level42 level4 level46)
(sum level42 level8 level50)
(sum level42 level10 level52)
(sum level42 level16 level58)
(sum level42 level17 level59)
(sum level42 level18 level60)
(sum level42 level20 level62)
(sum level43 level1 level44)
(sum level43 level3 level46)
(sum level43 level4 level47)
(sum level43 level8 level51)
(sum level43 level10 level53)
(sum level43 level16 level59)
(sum level43 level17 level60)
(sum level43 level18 level61)
(sum level43 level20 level63)
(sum level44 level1 level45)
(sum level44 level3 level47)
(sum level44 level4 level48)
(sum level44 level8 level52)
(sum level44 level10 level54)
(sum level44 level16 level60)
(sum level44 level17 level61)
(sum level44 level18 level62)
(sum level44 level20 level64)
(sum level45 level1 level46)
(sum level45 level3 level48)
(sum level45 level4 level49)
(sum level45 level8 level53)
(sum level45 level10 level55)
(sum level45 level16 level61)
(sum level45 level17 level62)
(sum level45 level18 level63)
(sum level45 level20 level65)
(sum level46 level1 level47)
(sum level46 level3 level49)
(sum level46 level4 level50)
(sum level46 level8 level54)
(sum level46 level10 level56)
(sum level46 level16 level62)
(sum level46 level17 level63)
(sum level46 level18 level64)
(sum level46 level20 level66)
(sum level47 level1 level48)
(sum level47 level3 level50)
(sum level47 level4 level51)
(sum level47 level8 level55)
(sum level47 level10 level57)
(sum level47 level16 level63)
(sum level47 level17 level64)
(sum level47 level18 level65)
(sum level47 level20 level67)
(sum level48 level1 level49)
(sum level48 level3 level51)
(sum level48 level4 level52)
(sum level48 level8 level56)
(sum level48 level10 level58)
(sum level48 level16 level64)
(sum level48 level17 level65)
(sum level48 level18 level66)
(sum level48 level20 level68)
(sum level49 level1 level50)
(sum level49 level3 level52)
(sum level49 level4 level53)
(sum level49 level8 level57)
(sum level49 level10 level59)
(sum level49 level16 level65)
(sum level49 level17 level66)
(sum level49 level18 level67)
(sum level49 level20 level69)
(sum level50 level1 level51)
(sum level50 level3 level53)
(sum level50 level4 level54)
(sum level50 level8 level58)
(sum level50 level10 level60)
(sum level50 level16 level66)
(sum level50 level17 level67)
(sum level50 level18 level68)
(sum level50 level20 level70)
(sum level51 level1 level52)
(sum level51 level3 level54)
(sum level51 level4 level55)
(sum level51 level8 level59)
(sum level51 level10 level61)
(sum level51 level16 level67)
(sum level51 level17 level68)
(sum level51 level18 level69)
(sum level51 level20 level71)
(sum level52 level1 level53)
(sum level52 level3 level55)
(sum level52 level4 level56)
(sum level52 level8 level60)
(sum level52 level10 level62)
(sum level52 level16 level68)
(sum level52 level17 level69)
(sum level52 level18 level70)
(sum level52 level20 level72)
(sum level53 level1 level54)
(sum level53 level3 level56)
(sum level53 level4 level57)
(sum level53 level8 level61)
(sum level53 level10 level63)
(sum level53 level16 level69)
(sum level53 level17 level70)
(sum level53 level18 level71)
(sum level53 level20 level73)
(sum level54 level1 level55)
(sum level54 level3 level57)
(sum level54 level4 level58)
(sum level54 level8 level62)
(sum level54 level10 level64)
(sum level54 level16 level70)
(sum level54 level17 level71)
(sum level54 level18 level72)
(sum level54 level20 level74)
(sum level55 level1 level56)
(sum level55 level3 level58)
(sum level55 level4 level59)
(sum level55 level8 level63)
(sum level55 level10 level65)
(sum level55 level16 level71)
(sum level55 level17 level72)
(sum level55 level18 level73)
(sum level55 level20 level75)
(sum level56 level1 level57)
(sum level56 level3 level59)
(sum level56 level4 level60)
(sum level56 level8 level64)
(sum level56 level10 level66)
(sum level56 level16 level72)
(sum level56 level17 level73)
(sum level56 level18 level74)
(sum level56 level20 level76)
(sum level57 level1 level58)
(sum level57 level3 level60)
(sum level57 level4 level61)
(sum level57 level8 level65)
(sum level57 level10 level67)
(sum level57 level16 level73)
(sum level57 level17 level74)
(sum level57 level18 level75)
(sum level57 level20 level77)
(sum level58 level1 level59)
(sum level58 level3 level61)
(sum level58 level4 level62)
(sum level58 level8 level66)
(sum level58 level10 level68)
(sum level58 level16 level74)
(sum level58 level17 level75)
(sum level58 level18 level76)
(sum level58 level20 level78)
(sum level59 level1 level60)
(sum level59 level3 level62)
(sum level59 level4 level63)
(sum level59 level8 level67)
(sum level59 level10 level69)
(sum level59 level16 level75)
(sum level59 level17 level76)
(sum level59 level18 level77)
(sum level59 level20 level79)
(sum level60 level1 level61)
(sum level60 level3 level63)
(sum level60 level4 level64)
(sum level60 level8 level68)
(sum level60 level10 level70)
(sum level60 level16 level76)
(sum level60 level17 level77)
(sum level60 level18 level78)
(sum level61 level1 level62)
(sum level61 level3 level64)
(sum level61 level4 level65)
(sum level61 level8 level69)
(sum level61 level10 level71)
(sum level61 level16 level77)
(sum level61 level17 level78)
(sum level61 level18 level79)
(sum level62 level1 level63)
(sum level62 level3 level65)
(sum level62 level4 level66)
(sum level62 level8 level70)
(sum level62 level10 level72)
(sum level62 level16 level78)
(sum level62 level17 level79)
(sum level63 level1 level64)
(sum level63 level3 level66)
(sum level63 level4 level67)
(sum level63 level8 level71)
(sum level63 level10 level73)
(sum level63 level16 level79)
(sum level64 level1 level65)
(sum level64 level3 level67)
(sum level64 level4 level68)
(sum level64 level8 level72)
(sum level64 level10 level74)
(sum level65 level1 level66)
(sum level65 level3 level68)
(sum level65 level4 level69)
(sum level65 level8 level73)
(sum level65 level10 level75)
(sum level66 level1 level67)
(sum level66 level3 level69)
(sum level66 level4 level70)
(sum level66 level8 level74)
(sum level66 level10 level76)
(sum level67 level1 level68)
(sum level67 level3 level70)
(sum level67 level4 level71)
(sum level67 level8 level75)
(sum level67 level10 level77)
(sum level68 level1 level69)
(sum level68 level3 level71)
(sum level68 level4 level72)
(sum level68 level8 level76)
(sum level68 level10 level78)
(sum level69 level1 level70)
(sum level69 level3 level72)
(sum level69 level4 level73)
(sum level69 level8 level77)
(sum level69 level10 level79)
(sum level70 level1 level71)
(sum level70 level3 level73)
(sum level70 level4 level74)
(sum level70 level8 level78)
(sum level71 level1 level72)
(sum level71 level3 level74)
(sum level71 level4 level75)
(sum level71 level8 level79)
(sum level72 level1 level73)
(sum level72 level3 level75)
(sum level72 level4 level76)
(sum level73 level1 level74)
(sum level73 level3 level76)
(sum level73 level4 level77)
(sum level74 level1 level75)
(sum level74 level3 level77)
(sum level74 level4 level78)
(sum level75 level1 level76)
(sum level75 level3 level78)
(sum level75 level4 level79)
(sum level76 level1 level77)
(sum level76 level3 level79)
(sum level77 level1 level78)
(sum level78 level1 level79)

(connected l0 l1)
(fuelcost level10 l0 l1)
(connected l0 l4)
(fuelcost level17 l0 l4)
(connected l0 l5)
(fuelcost level20 l0 l5)
(connected l0 l6)
(fuelcost level1 l0 l6)
(connected l1 l0)
(fuelcost level10 l1 l0)
(connected l1 l2)
(fuelcost level4 l1 l2)
(connected l1 l3)
(fuelcost level3 l1 l3)
(connected l1 l5)
(fuelcost level16 l1 l5)
(connected l1 l6)
(fuelcost level8 l1 l6)
(connected l2 l1)
(fuelcost level4 l2 l1)
(connected l2 l5)
(fuelcost level3 l2 l5)
(connected l3 l1)
(fuelcost level3 l3 l1)
(connected l3 l5)
(fuelcost level18 l3 l5)
(connected l4 l0)
(fuelcost level17 l4 l0)
(connected l5 l0)
(fuelcost level20 l5 l0)
(connected l5 l1)
(fuelcost level16 l5 l1)
(connected l5 l2)
(fuelcost level3 l5 l2)
(connected l5 l3)
(fuelcost level18 l5 l3)
(connected l6 l0)
(fuelcost level1 l6 l0)
(connected l6 l1)
(fuelcost level8 l6 l1)

(at t0 l5)
(fuel t0 level79)
(= (total-cost) 0)

(at p0 l4)
(at p1 l1)
(at p2 l0)
(at p3 l4)
(at p4 l2)
(at p5 l4)
(at p6 l4)
(at p7 l4)
(at p8 l4)
(at p9 l2)
)

(:goal
(and
(at p0 l6)
(at p1 l6)
(at p2 l4)
(at p3 l1)
(at p4 l3)
(at p5 l5)
(at p6 l3)
(at p7 l6)
(at p8 l6)
(at p9 l6)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l5 l2 level76 level3 level79)
   deleted: (at t0 l5) (fuel t0 level79)
   added: (at t0 l2) (fuel t0 level76)
   goals met: 0 of 10
2. (load p9 t0 l2)
   deleted: (at p9 l2)
   added: (in p9 t0)
   goals met: 0 of 10
3. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 0 of 10
4. (drive t0 l2 l1 level72 level4 level76)
   deleted: (at t0 l2) (fuel t0 level76)
   added: (at t0 l1) (fuel t0 level72)
   goals met: 0 of 10
5. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 0 of 10
6. (drive t0 l1 l0 level62 level10 level72)
   deleted: (at t0 l1) (fuel t0 level72)
   added: (at t0 l0) (fuel t0 level62)
   goals met: 0 of 10
7. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 0 of 10
8. (drive t0 l0 l4 level45 level17 level62)
   deleted: (at t0 l0) (fuel t0 level62)
   added: (at t0 l4) (fuel t0 level45)
   goals met: 0 of 10
9. (unload p2 t0 l4)
   deleted: (in p2 t0)
   added: (at p2 l4)
   goals met: 1 of 10
10. (load p8 t0 l4)
   deleted: (at p8 l4)
   added: (in p8 t0)
   goals met: 1 of 10
11. (load p7 t0 l4)
   deleted: (at p7 l4)
   added: (in p7 t0)
   goals met: 1 of 10
12. (load p6 t0 l4)
   deleted: (at p6 l4)
   added: (in p6 t0)
   goals met: 1 of 10
13. (load p5 t0 l4)
   deleted: (at p5 l4)
   added: (in p5 t0)
   goals met: 1 of 10
14. (load p3 t0 l4)
   deleted: (at p3 l4)
   added: (in p3 t0)
   goals met: 1 of 10
15. (load p0 t0 l4)
   deleted: (at p0 l4)
   added: (in p0 t0)
   goals met: 1 of 10
16. (drive t0 l4 l0 level28 level17 level45)
   deleted: (at t0 l4) (fuel t0 level45)
   added: (at t0 l0) (fuel t0 level28)
   goals met: 1 of 10
17. (drive t0 l0 l6 level27 level1 level28)
   deleted: (at t0 l0) (fuel t0 level28)
   added: (at t0 l6) (fuel t0 level27)
   goals met: 1 of 10
18. (unload p0 t0 l6)
   deleted: (in p0 t0)
   added: (at p0 l6)
   goals met: 2 of 10
19. (unload p1 t0 l6)
   deleted: (in p1 t0)
   added: (at p1 l6)
   goals met: 3 of 10
20. (unload p7 t0 l6)
   deleted: (in p7 t0)
   added: (at p7 l6)
   goals met: 4 of 10
21. (unload p8 t0 l6)
   deleted: (in p8 t0)
   added: (at p8 l6)
   goals met: 5 of 10
22. (unload p9 t0 l6)
   deleted: (in p9 t0)
   added: (at p9 l6)
   goals met: 6 of 10
23. (drive t0 l6 l1 level19 level8 level27)
   deleted: (at t0 l6) (fuel t0 level27)
   added: (at t0 l1) (fuel t0 level19)
   goals met: 6 of 10
24. (drive t0 l1 l3 level16 level3 level19)
   deleted: (at t0 l1) (fuel t0 level19)
   added: (at t0 l3) (fuel t0 level16)
   goals met: 6 of 10
25. (unload p4 t0 l3)
   deleted: (in p4 t0)
   added: (at p4 l3)
   goals met: 7 of 10
26. (unload p6 t0 l3)
   deleted: (in p6 t0)
   added: (at p6 l3)
   goals met: 8 of 10
27. (drive t0 l3 l1 level13 level3 level16)
   deleted: (at t0 l3) (fuel t0 level16)
   added: (at t0 l1) (fuel t0 level13)
   goals met: 8 of 10
28. (unload p3 t0 l1)
   deleted: (in p3 t0)
   added: (at p3 l1)
   goals met: 9 of 10
29. (drive t0 l1 l2 level9 level4 level13)
   deleted: (at t0 l1) (fuel t0 level13)
   added: (at t0 l2) (fuel t0 level9)
   goals met: 9 of 10
30. (drive t0 l2 l5 level6 level3 level9)
   deleted: (at t0 l2) (fuel t0 level9)
   added: (at t0 l5) (fuel t0 level6)
   goals met: 9 of 10
31. (unload p5 t0 l5)
   deleted: (in p5 t0)
   added: (at p5 l5)
   goals met: 10 of 10
